[
  {
    "path": "posts/2021-06-10-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "Explore perspectives of Singapore Merchandise Trade in multiple markets from 2011 to 2020.",
    "author": [
      {
        "name": "Youzhen Zhang",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-15",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Overview\r\n2. Critiques and Suggestions\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Design\r\n4. Data Visualisation Steps\r\n4.1 Data preparation\r\n4.2 Data visualisation\r\n\r\n\r\n1. Overview\r\nThe original visualisation below is created by using Merchandise Trade by Region/Market data provided by Department of Statistics, Singapore (DOS). In this post, this visualisation will be evaluated in terms of clarity and aesthetics. Also, alternative graphical presentation will be provided to improve the current graph and give more meaningful insights.\r\nThe original design as shown below. \r\n2. Critiques and Suggestions\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nLack of a title to give a brief introduction for the visualisation - A proper title that describe the intend of the graph well can help users to understand the visualisation easier and better.\r\nAdd a title that can precisely convey the visualisation.\r\n2\r\nThe title and value for the Axis is misleading - Just use import and export as the title for Y-axis and X-axis respectively is vague, users can not easily identify whether the value of axis is the actual merchandise trade volume or the percentage of merchandise trade volume.\r\nUse the proper title for both Y-axis and X-axis.\r\n3\r\nNo indication for the Period of the merchandise trade volume - The data source contains lots of merchandise trade data from 1976 to 2021, users can not be able to identify the period for the merchandise trade shown in the visualisation if no additional information to emphasize the specific period.\r\nAdd information to clarify the period observed in the title or in the chart.\r\n4\r\nThe conclusion information highlighted in the bottom of the visualisation can not be drawn from the graph above - The year 2009 and 2006 are mentioned in the conclusion, but there is no related information shown in the graph. It is difficult for users to match the year and the merchandise trade according to the visualisation.\r\nClarify the period observed and make proper conclusions based on the visualisation.\r\n5\r\nThe merchandise trade value shown with each bubble confused users easily - As users can not understand the value that may refer to either the import trade value or export trade value unless he read the notes carefully, then he can realize the value is referring to the total merchandise trade value.\r\nClarify the value source in the title or in the tooltip.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nColour palette used is glaring and not meaningful as it does not enhance the conveyance of information -\r\nUse diverging color the show the bubble. For example, use red-blue diverging color to differentiate the value of total trade.\r\n2\r\nSome center points of bubble are obscured by the marker - The position of the center point of each bubble represents whether the value of import exceed the value of export for each market. Users can not get this information if the center point is obscured.\r\nAdjust the position of the marker to avoid keep some major information out or use different color for the border of the bubble to mark whether the import value exceeds to export value.\r\n3\r\nThe icon for ‘Top net exporter’ and ‘Top net importer’ under the note is not necessary, it can be added into the tooltip and shown with the marker in the chart directly.\r\nRemove the Notation for the icon ‘top net importer’ and ‘top net exporter’, add the information into the tooltip.\r\n4\r\nAn static chart may not be the most appropriate chart - as there are lots of variables, including lots of trade markets, 2 trade type and periods of trade, it is difficult to gauge using a static chart.\r\nInstead of using a static chart, An interactive chart with filters can be used.\r\n3. Proposed Design\r\n4. Data Visualisation Steps\r\n4.1 Data preparation\r\nRemove unnecessary rows\r\nFor both Import data and Export data, delete the top five rows to let the row for ‘Variables’ and ‘the monthly period’ to be the first row, then delete the row for ‘Total Merchandise Trade’ and rename the data sheet ‘Import’ and ‘Export’ respectively using Excel. \r\nImport data into Tableau\r\nAfter importing data file into Tableau, double click ‘New Union’ on the left side of the page,then drag import file and export file into the ‘Union’ Popup, click Apply and Ok.\r\n\r\nSplit column\r\nClick the triangle sign on the left top of the ‘Variables’ column, then click split, the column would be split into two more columns. one is ‘Variables - Split 1’ and the other is ‘Variables - Split 2’.\r\n\r\nthe columns are as shown below after splitting.\r\n\r\nChange data type\r\nChange the data type for Variables column by clicking the data type icon on the right top of this column, and select ‘Geograhic Role’ - ‘Country/Region’. \r\nChange column name\r\nChange the name of ‘Variables - Split 1’ to ‘Markets’ by clicking the name of this column.\r\n\r\nHide columns\r\nHide all the columns except the ‘Markets’ ,‘Sheet’ and the column from ‘Jan 2011’ to ‘Dec 2020’ by selecting the columns and right click, then clicking hide to hide columns.\r\n\r\nCreate data pivot\r\nSelect columns from ‘Jan 2011’ to ‘Dec 2020’ at one time and right click, then click pivot.\r\n\r\nThe pivot is as shown.\r\n\r\nChange column name for pivot table\r\nChange ‘Pivot Names’ and ‘Pivot Values’ column to ‘Period’ and ‘Values’ respectively by double click the column name.\r\n\r\nChange data type for pivot table\r\nChange the data type for the ‘Period’ column to ‘date’ by clicking the data type icon on th right top of the column and select ‘date’.\r\nChang the data type for the ‘Values’ column to ‘Numbers’ by clicking the data type icon on th right top of the column and select ‘Numbers(decimal)’.\r\n\r\n4.2 Data visualisation\r\n1. Visualisation for Bubble Chart\r\n1.1. Create Calculated Fields\r\nClick ‘Analysis’ and select ‘Create Calculated Field’, then input ‘Export’ as the name of this field and input the formula in the box below. Repeat the same step to create the field called Import using ‘Import’ to replace ‘Export’ in the formula.\r\n\r\n1.2 Drag data into canvas\r\nDrag [Export] and [Import] to Columns and Rows respectively.\r\n\r\n1.2 Change Axis value to Percentage\r\nChange Y-axis and X-axis to percentage by clicking Analysis and selecting Percentage of - Table.\r\n\r\n1.3 Apply Detail\r\nDrag [Markets] to Detail,then the chart would show the detail for each Market.\r\n\r\n1.4 Change table calculation to percentile\r\nClick the triangle sign of ‘SUM(Import)’ and ‘SUM(Export)’ and select ‘Quick Table Calculation’ and ‘Percentile’.\r\n\r\n1.5 Change Compute Using\r\nClick the triangle sign of ‘SUM(Import)’ and ‘SUM(Export)’ and select ‘Compute Using’ and ‘Markets’.\r\n\r\n1.6 Apply color\r\nDrag [Export] to color,then change the measure type to sum by right click the [Values-Export] in Marks box.\r\n\r\n1.5 Edit color\r\nclick color pane and select line with dot marker. The graph will be colored automatically.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-18T20:50:47+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Explore perspectives of Singapore Merchandise Trade in six markets from 2019 to 2020.",
    "author": [
      {
        "name": "Youzhen Zhang",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Overview\r\n2. Critiques and Recommendations\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Design\r\n4. Data Visualisation Steps\r\n4.1 Data preparation\r\n4.2 Data visualisation\r\n\r\n5. Final Visualization\r\n5.1 Snapshot of dashboard\r\n5.2 Major Insights\r\n\r\n\r\n1. Overview\r\nThe original visualisation below is created by using Merchandise Trade by Region/Market data provided by Department of Statistics, Singapore (DOS). In this post, this visualisation will be evaluated in terms of clarity and aesthetics. Also, an makeover of this graph will be provided. \r\n2. Critiques and Recommendations\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nChart title is not precise – The title “Merchandise Trade of Top Six Trading Countries,2019-2020” does not convey the intent of the graph well. The chart refers to the merchandise trade of top six regions from 2019 to 2020, making it difficult to identify the ranking of the six markets quickly.\r\nChange title to “Merchandise Trade of Six Trading Regions from 2019 to 2020”.\r\n2\r\nThe scale of X axis is not correct – The scale of X axis is from 2019 to 2021 that is inconsistent with the title of the graph. Also, the scale of values on X axis is year that is against the title of X axis.\r\nModify the scale of X axis of the graph only from 2019 to 2020 as presented in the title of the graph and change the scale of values on X axis to be year of period.\r\n3\r\nInappropriate usage of graph – A area graph is not a suitable graphing method to show the values of both import and export merchandise trade of regions. There are overlaps between the area of export and import merchandise trade, making it difficult to identify the information from export and import merchandise trade.\r\nIt would be much clearer if using a line graph to show the merchandise trade.\r\n4\r\nLack of captions in the graph – Captions can provide brief explanations accompanying to the graph.\r\nAdd captions at the bottom of the graph.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nThe font size and location of each region label – Font size of the label should be smaller than the title of the graph’s. The location of the label should be at the center to indicate the related area graph clearly.\r\nChange the font size of the region label smaller than the font size of title and move the label to the center of each area graph.\r\n2\r\nSix area graphs are redundant – It is not necessary to use six area graphs in the visualisation since the six area graphs have same coordinate axis and layouts.\r\nOnly keep one graph to show values with same coordinate axis and layouts.\r\n3\r\nColors used to differentiate the import and export merchandise trade do not highlight the graph – Colors used should be with higher degree of contrast to easy highlight the graph.\r\nUse colors with higher degree of contrast to differentiate the graph.\r\n4\r\nMultiple unit measurements of Y axis used in the graph – different unit measurements of Y axis may make readers be confused.\r\nKeep the unit measurements of both Y axis and X axis uniform.\r\n3. Proposed Design\r\n\r\n4. Data Visualisation Steps\r\n4.1 Data preparation\r\nData: Merchandise Imports By Region/Market, Monthly\r\nRemove unnecessary columns\r\nDelete useless columns, only keep column Variables and columns from 2019 Jan to 2020 Dec using Excel. \r\nRemove useless rows\r\nRemove unnecessary rows using Excel. \r\nImport into Tableau & Create data pivot\r\nAfter importing data file into Tableau, the data from January 2019 to December 2020 are spread across multiple columns. Then, we can create a flat file to get a target view by selecting the columns from 2019 Jan to 2020 Dec, right click and selecting pivot. \r\nRename column headers\r\nRename ‘Variables’ to ‘Region_Import’. Rename ‘Pivot Field Names’ to ‘Period_Import’. Rename ‘Pivot Field Values’ to ‘Trade Values_Import’. \r\nChange data type\r\nChange ‘Region_Import’ data type to ‘Geographic Role - Country/Region’. Change ‘Period_Import’ data type to ‘Date’. Change ‘Trade Values_Import’ data type to ‘Number(Whole)’. \r\nData: Merchandise Exports By Region/Market, Monthly\r\nTidy data and format data\r\nRepeat steps 1 to 3 as done for data ‘Merchandise Exports By Region/Market, Monthly’ above.\r\nRename column headers\r\nRename ‘Variables’ to ‘Region_Export’. Rename ‘Pivot Field Names’ to ‘Period_Export’. Rename ‘Pivot Field Values’ to ‘Trade Values_Export’.\r\nChange data type\r\nChange ‘Region_Export’ data type to ‘Geographic Role - Country/Region’. Change ‘Period_Export’ data type to ‘Date’. Change ‘Trade Values_Export’ data type to ‘Number(Whole)’.\r\n4.2 Data visualisation\r\nVisualisation for Merchandise import trade\r\nCreate line chart\r\nDrag [Period_import] and [Trade_Values_Import] to Columns and Rows respectively. Click [Period_import] and select ‘Quarter Year’ type. \r\nApply filter\r\nDrag [Region_Import] to Filters panel, and check these 6 values: Mainland China, Hong Kong, Taiwan, Malaysia, Japan and United States. \r\nApply colour\r\nDrag [Region_Import] to colour,then click colour and select line with dot marker. The graph will be colored automatically.\r\n\r\nRename axis\r\nRename y-axis to “Merchandise Trade Value”. Rename x-axis to “Quarter of Period”.\r\nAdd title\r\nAdd title “Merchandise Import Trade in Six Markets, 2019-2020” using boldface.\r\nAdd Caption\r\nRight click the graph and select “caption” to edit caption. Then the graph should shown as below.\r\n\r\nVisualisation for Merchandise export trade\r\nRepeat steps 1 to 6 as done for data ‘Visualisation for Merchandise import trade’ above except using data from export table instead of data from import table. \r\nVisualisation for Total Merchandise trade\r\nCreate calculated field\r\nClick ‘Create calculated field’ and input formula “IF Year([Period_Import])=2019 THEN [Trade_Values_Import]+[Trade_Values_Export] END” to create a new field named [2019].\r\nClick ‘Create calculated field’ and input formula “IF Year([Period_Import])=2020 THEN [Trade_Values_Import]+[Trade_Values_Export] END” to create a new field named [2020].\r\n\r\nCreate bar chart\r\nDrag [2019],[2020] and [Region_Import] to Columns and Rows respectively. Click X aixs of the 2019 to edit and select ‘reversed’ type for the axis.\r\n\r\nApply filter\r\nDrag [Region_Import] to Filters panel, and check these 6 values: Mainland China, Hong Kong, Taiwan, Malaysia, Japan and United States. \r\nApply colour\r\nClick ‘Color’ to edit colour n the Marks pane for 2019 ar chart,then the graph will be colored automatically.\r\n\r\nAdd title\r\nAdd title “Total Merchandise Trade of Six Markets, 2019-2020” using boldface. Then, the graph should shown as below. \r\nFull visualisation available at Tableau Public\r\n5. Final Visualization\r\n5.1 Snapshot of dashboard\r\n\r\n5.2 Major Insights\r\nMainland China is the biggest merchandise trade market for Singapore among the six markets from 2019 to 2020, although the total merchandise trade volumn has a sight decline in 2020.\r\nThe total merchandise trade volumns in Taiwan and Hong Kong markets keep increasing from 2019 to 2020, while the merchandise trade values for other four markets in 2020 are less than that in 2019.\r\nMerchandise trade in quarter four is always higher than that in other three quarters for Both Merchandise import trade and export trade.\r\nBoth merchandise exports and imports in Japan market show a almost stable trend from 2019 to 2020.\r\nAlthough merchandise import trade in Hong Kong is always lower than other markets, the merchandise export trade shows a increase trend from 2019 to 2020. The merchandise export trade volumn in Hong Kong markets is higher than other four markets except Mainland China market.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-13T17:36:15+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
