[
  {
    "path": "posts/2021-07-14-assignment/",
    "title": "VAST Challenge 2021 MC2",
    "description": "User performance analytics based on movement and purchase data.",
    "author": [
      {
        "name": "Youzhen Zhang",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-07-14",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n1.1 Backgroud of the case\r\n1.2 Objectives of this report\r\n\r\n2. Literature Review\r\n3. Data Preperation\r\n3.1 Install and load packages\r\n3.2 Import data\r\n3.3 Data processing\r\n\r\n4. Data analysis and visualisation\r\n4.1 Most popular location\r\n4.2 Most popular timeslot\r\n4.3 Anomalies about credit card and loyalty data\r\n4.4 Recommandations for correcting anomalies\r\n4.5 Discrepancies between vehicle, credit, and loyalty card data\r\n4.6 Mapping credit card and loyalty card\r\n\r\n5. Insights\r\n5.1 Most popular location and timeslot\r\n5.2 Anomalies and corrections for credit card and loyalty card data\r\n\r\n\r\n1. Introduction\r\n1.1 Backgroud of the case\r\nSeveral employees of GAStech go missing, the case is under investigation.\r\nMany of the Abila, Kronos-based employees of GAStech have company cars which were installed geospatial tracking software to track data periodically as long as they are moving.\r\nThis vehicle tracking data has been made available to law enforcement to support their investigation. Unfortunately, data is not available for the day the GAStech employees went missing. Data is only available for the two weeks prior to the disappearance.\r\nAlso, Kronos based companies provide a Kronos Kares benefit card to GASTech employees giving them discounts and rewards in exchange for collecting information about their credit card purchases and preferences as recorded on loyalty cards. This data has been made available to investigators in the hopes that it can help resolve the situation.\r\n1.2 Objectives of this report\r\nThe objectives of this case analysis report is to identify which GASTech employees made which purchases and identify suspicious patterns of behavior. During the analysis, 3 aspects were taken into consideration:\r\nUsing just the credit and loyalty card data, identify the most popular locations, and when they are popular. Also, recommendations should be given to correct these anomalies.\r\nAdd the vehicle data to analysis of the credit and loyalty card data and figure out the discrepancies between vehicle, credit, and loyalty card data.\r\nInfer the owners of each credit card and loyalty card and provide the evidences for that.\r\n2. Literature Review\r\nIn the literature review conducted, it was found that there were some geospatial data in the datasets. To delivery a clear analysis based on tracking movement trace, I examined how to visualise movement data by using appropriate R packages. Also, as there were two card datasets provided for analysis and we need to explore the relationships between two kind of cards, I examined how join and merge tables by using appropriate R packages. Besides, I did some research about ggplot packages in order to plot some appropriate charts to visualisation.\r\nTo get a better understanding about the relationship between employee and credit card, some network data visualisation and analysis techniques would be used. For example, build network graph visualisation using appropriate functions of ggraph.\r\n3. Data Preperation\r\n3.1 Install and load packages\r\nWe need to set up the environment and load all required packages first. The code chunk below will install the packages if not yet installed, and load them to the environment.\r\n\r\n\r\npackages = c('ggiraph', 'plotly', 'DT', 'patchwork','plyr',\r\n             'tidyverse','raster', 'sf', 'igraph', 'tidygraph', \r\n             'ggraph', 'visNetwork', \r\n             'lubridate', 'clock','tmap','rmarkdown')\r\n\r\nfor (p in packages){\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p,character.only = T)\r\n}\r\n\r\n\r\n\r\n3.2 Import data\r\nThe data was loaded using read.csv() of the readr package, which reads delimited files into a tibble.\r\n\r\n\r\ncc_data <- read.csv(\"MC2/cc_data.csv\")\r\nloyalty_data <- read.csv(\"MC2/loyalty_data.csv\")\r\ngps <- read.csv(\"MC2/gps.csv\")\r\n\r\n\r\n\r\n3.3 Data processing\r\nChange variables to the proper data type and create new variables for further analysis.\r\n\r\n\r\ncc_data$timestamp <- date_time_parse(cc_data$timestamp,\r\n                                 zone = \"\",\r\n                                 format = \"%m/%d/%Y %H:%M\")\r\n\r\ncc_data$date <- substr(cc_data$timestamp,1,10)\r\n\r\ncc_data$date <- date_parse(cc_data$date,format = \"%Y-%m-%d\")\r\n\r\nloyalty_data$date <- date_parse(loyalty_data$timestamp,\r\n                                format = \"%m/%d/%Y\")\r\n\r\n\r\n\r\nCombine credit card data and loyalty card data into a new data frame based on the same location, timestamp and price in order to identify the most popular place and the most popular timeslot. Also, rename the columns for the new data frame.\r\n\r\n\r\ncombine_cc_loyalty = cc_data %>% inner_join(loyalty_data,\r\n                                          by=c('location','price','date'))\r\nsum_by_location <- combine_cc_loyalty %>%\r\nselect(location, price) %>%\r\ngroup_by(location) %>%\r\nsummarise(total_price = sum(price), total_count = n()) %>%\r\narrange(desc(total_count), desc(total_price))\r\n\r\ncolnames(combine_cc_loyalty)[1] <- \"timestamp\"\r\n\r\n\r\n\r\n4. Data analysis and visualisation\r\n4.1 Most popular location\r\nwe identify the most popular locations based on shopping frequency and the amount of money spent.\r\n\r\n\r\nggplot(sum_by_location, aes(x = location)) +\r\n  geom_col(aes( y = total_count, fill=\"steelblue\")) +\r\n  scale_y_continuous(name = \"Frequency\") +\r\n  scale_fill_manual('', labels = 'Frequency', values = \"steelblue\") +\r\n  theme(axis.text.x = element_text(angle = 90),legend.position=\"bottom\")\r\n\r\n\r\n\r\n\r\n4.2 Most popular timeslot\r\nBased on the most popular location, we explore the most popular time people visit in 24 hours each day using heatmap graph, the darker the color is, the more popular the place is in this timeslot.\r\n\r\n\r\npopular_time <- combine_cc_loyalty %>%\r\n  select(location,date,timestamp,price) %>%\r\n  filter(location == \"Katerina’s Café\"|location == \"Guy's Gyros\" |location == \"Hippokampos\"|location == \"Brew've Been Served\") \r\n\r\npopular_time$hour <- hour(popular_time$timestamp)\r\n\r\npopular_time_count <- popular_time %>%\r\n  group_by(location,date,hour) %>%\r\n  summarise(frequency = n())\r\n\r\npopular_time_count <- popular_time_count %>%\r\n  right_join(expand.grid(location = unique(popular_time$location),\r\n                       date = unique(popular_time$date),\r\n                       hour = c(1:23)),\r\n             by =c('location','date','hour')) %>%\r\n  replace_na(list(frequency = 0L))\r\n\r\nggplot(popular_time_count,aes(date, hour, fill= frequency)) + \r\ngeom_tile(color = 'white',size = 0.1) + \r\n  facet_grid(~location) +\r\n   scale_fill_distiller(palette = \"orange\",direction = 1)+\r\n  scale_x_date(breaks = popular_time_count$date[seq(1, length(popular_time_count$date), by = 2)])+\r\n  scale_y_continuous(breaks = seq(1,24,2)) +\r\n  theme(axis.text.x = element_text(angle = 90),legend.position=\"bottom\")\r\n\r\n\r\n\r\n\r\n4.3 Anomalies about credit card and loyalty data\r\nAs loyalty cards data is always generated from credit cards data, both the data should be same by right. However, the some transactions data in credit card dataset are not consistent with the data in loyalty dataset. There are 1490 and 1392 transactions in credit card dataset and loyalty dataset respectively. Also, just 1087 transactions can match based on the location, timestamp and price spent for each transaction.\r\n\r\n\r\nnrow(cc_data)\r\n\r\n\r\n[1] 1490\r\n\r\nnrow(loyalty_data)\r\n\r\n\r\n[1] 1392\r\n\r\nnrow(combine_cc_loyalty)\r\n\r\n\r\n[1] 1087\r\n\r\nAll the transactions happened at Brew’ve Been Served were paid around 17 different credit cards. That means just 17 people always went there. It is less than other three popular locations which have 33 or 35 different visitors in the last two weeks.\r\n\r\n\r\nvisitor_count_for_location <- combine_cc_loyalty %>%\r\n  select(location,last4ccnum) %>%\r\n  filter(location == \"Katerina’s Café\"|location == \"Guy's Gyros\" |location == \"Hippokampos\"|location == \"Brew've Been Served\") %>%\r\n  group_by(location,last4ccnum) %>%\r\n  summarise(total_count = n()) %>%\r\n  select(location) %>%\r\n  group_by(location) %>%\r\n  summarise(count_credit_cards=n()) %>%\r\n  left_join(sum_by_location,by = c('location')) %>%\r\n  select(location, count_credit_cards,total_count) %>%\r\n  gather(count_credit_cards, total_count, key = \"key\", value = \"value\")\r\n\r\nggplot(visitor_count_for_location, aes(x = location)) +\r\n  geom_col(aes( y = value, fill=key),position = \"dodge\",width = .5) +\r\n  geom_text(aes(y = value, label= value),vjust =0)\r\n\r\n\r\n\r\n\r\nAlthough employees always went Katerina’s Café, Guy’s Gyros, Hippokampos and Brew’ve Been Served, they did not spend too much money there. On the contrary, employees spent more at Abila Airport, Nationwide Refinery, Carlyle Chemical Inc. and Stewart and Sons Fabrication even though they did not purchase there frequently.\r\n\r\n\r\nggplot(sum_by_location, aes(x = location)) +\r\n  geom_col(aes( y = total_count, fill=\"steelblue\")) +\r\n  geom_line(aes(y = total_price/500, group = 1, color = 'orange')) +\r\n  geom_point(aes(x=location, y=total_price/500, color=\"orange\"))+\r\n  scale_y_continuous(name = \"Frequency\", sec.axis = sec_axis(trans = ~ .* 500,name = \"Price\")) +\r\n  scale_fill_manual('', labels = 'Frequency', values = \"steelblue\") +\r\n  scale_color_manual('', labels = 'Total Price', values = 'orange') +\r\n  theme(axis.text.x = element_text(angle = 90),legend.position=\"bottom\")\r\n\r\n\r\n\r\n\r\n4.4 Recommandations for correcting anomalies\r\n1.Merge the transactions exiting in loyalty card data but not exiting in the credit card data to the credit card data in order to make up the missing transactions in credit card data.\r\n\r\n\r\nnew_cc_data <- merge(cc_data, combine_cc_loyalty,\r\n                              by=c('timestamp','location','price','last4ccnum'),all=TRUE)\r\n\r\nnew_cc_data <- new_cc_data[-c(488,497,507,513,674,683),] %>%\r\n  select(timestamp,location, price,last4ccnum,date.x,loyaltynum)\r\n\r\n\r\n\r\n\r\n\r\nnrow(new_cc_data)\r\n\r\n\r\n[1] 1490\r\n\r\n4.5 Discrepancies between vehicle, credit, and loyalty card data\r\nAdd the vehicle data to the analysis of the credit and loyalty card data,\r\n4.6 Mapping credit card and loyalty card\r\nMapping the credit card and loyalty card data based on the transactions with same location, transaction timestamp and price.\r\n\r\n\r\ncards_mapping <- new_cc_data %>%\r\nselect(last4ccnum,loyaltynum) %>%\r\nfilter(loyaltynum>0) %>%\r\ngroup_by(last4ccnum,loyaltynum) %>%\r\nsummarise(total_count = n()) %>%\r\narrange(desc(total_count))\r\n\r\ncards_mapping_cc <- cards_mapping %>%\r\n  summarise(no_count=n())\r\n\r\n\r\n\r\n5. Insights\r\n5.1 Most popular location and timeslot\r\nMost popular locations Katerina’s Café, Guy’s Gyros, Hippokampos and Brew’ve Been Served are the places people go and visit most. Because more transactions were produced there.\r\n\r\nMost popular timeslots For Katerina’s Café, Guy’s Gyros and Hippokamposmost, most of employees went there around 13pm to 15pm and 19pm to 21pm each day. For Brew’ve Been, people always went there around 7am to 8am on the weekdays.\r\n\r\n5.2 Anomalies and corrections for credit card and loyalty card data\r\nTransactions of credit card are inconsistent with loyalty cards’.\r\nAs loyalty cards data is always generated from credit cards data, both the data should be same by right. However, the some transactions data in credit card dataset are not consistent with the data in loyalty dataset. There are 1490 and 1392 transactions in credit card dataset and loyalty dataset respectively. Also, just 1087 transactions can match based on the location, timestamp and price spent for each transaction.\r\n{width =15%}\r\nTo correct this issue, we can merge the transactions exiting in loyalty card data but not exiting in the credit card data to the credit card data in order to make up the missing transactions in credit card data, then we can get a more comprehensive transaction data for purchases and preferences. Because the reason for the inconsistency might be that some employees did not record transactions on loyalty card although they indeed purchase something using their credit card. For the same reason, some employees recorded the purchase on their loyalty card but they did not pay that using given credit card.\r\n{width =15%}\r\nMost popular locations are different with the locations with higher purchase amount.\r\nAlthough employees always went Katerina’s Café, Guy’s Gyros, Hippokampos and Brew’ve Been Served, they did not spend too much money there. On the contrary, employees spent more at Abila Airport, Nationwide Refinery, Carlyle Chemical Inc. and Stewart and Sons Fabrication even though they did not purchase there frequently.\r\n\r\nFor this issue, we can category the location to explore the transactions produced by different business. Because the price of a order may vary from business to business.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-07-14-assignment/assignment_files/figure-html5/unnamed-chunk-5-1.png",
    "last_modified": "2021-07-23T17:36:49+08:00",
    "input_file": "assignment.knit.md"
  },
  {
    "path": "posts/2021-06-10-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "Explore Performance of Singapore's Merchandise Trade with top ten trade partners from 2011 to 2020.",
    "author": [
      {
        "name": "Youzhen Zhang",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-15",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Overview\r\n2. Critiques and Suggestions\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Design\r\n3.1 Sketch\r\n3.2 Advantages of Proposed Design\r\n\r\n4. Data Visualisation Steps\r\n4.1 Data preparation\r\n4.2 Data visualisation\r\n\r\n5. Final Visualization\r\n5.1 Snapshot of dashboard\r\n5.2 Major Insights\r\n\r\n\r\n1. Overview\r\nThe original visualisation below is created by using Merchandise Trade by Region/Market data provided by Department of Statistics, Singapore (DOS). In this post, this visualisation will be evaluated in terms of clarity and aesthetics. Also, alternative graphical presentation will be provided to improve the current graph and give more meaningful insights.\r\nThe original design as shown below. \r\n2. Critiques and Suggestions\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nLack of a title to give a brief introduction for the visualisation - A proper title that describe the intend of the graph well can help users to understand the visualisation easier and better.\r\nAdd a title that can precisely convey the visualisation.\r\n2\r\nThe title and value for the Axis is misleading - Just use import and export as the title for Y-axis and X-axis respectively is vague, users can not easily identify whether the value of axis is the actual merchandise trade volume or the percentage of merchandise trade volume.\r\nUse the proper title for both Y-axis and X-axis.\r\n3\r\nNo indication for the Period of the merchandise trade volume - The data source contains lots of merchandise trade data from 1976 to 2021, users can not be able to identify the period for the merchandise trade shown in the visualisation if no additional information to emphasize the specific period.\r\nAdd information to clarify the period observed in the title or in the chart.\r\n4\r\nThe conclusion information highlighted in the bottom of the visualisation can not be drawn from the graph above - The year 2009 and 2006 are mentioned in the conclusion, but there is no related information shown in the graph. It is difficult for users to match the year and the merchandise trade according to the visualisation.\r\nClarify the period observed and make proper conclusions based on the visualisation.\r\n5\r\nThe merchandise trade value shown with each bubble confused users easily - As users can not understand the value that may refer to either the import trade value or export trade value unless he read the notes carefully, then he can realize the value is referring to the total merchandise trade value.\r\nClarify the value source in the title or in the tooltip.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nColour palette used is glaring and not meaningful as it does not enhance the conveyance of information -\r\nUse diverging color the show the bubble. For example, use red-blue diverging color to differentiate the value of total trade.\r\n2\r\nSome center points of bubble are obscured by the marker - The position of the center point of each bubble represents whether the value of import exceed the value of export for each market. Users can not get this information if the center point is obscured.\r\nAdjust the position of the marker to avoid keep some major information out or use different color for the border of the bubble to mark whether the import value exceeds to export value.\r\n3\r\nThe icon for ‘Top net exporter’ and ‘Top net importer’ under the note is not necessary, it can be added into the tooltip and shown with the marker in the chart directly.\r\nRemove the Notation for the icon ‘top net importer’ and ‘top net exporter’, add the information into the tooltip.\r\n4\r\nAn static chart may not be the most appropriate chart - as there are lots of variables, including lots of trade markets, 2 trade type and periods of trade, it is difficult to gauge using a static chart.\r\nInstead of using a static chart, An interactive chart with filters can be used.\r\n3. Proposed Design\r\n3.1 Sketch\r\n\r\n3.2 Advantages of Proposed Design\r\nUsing a proper title to give users a brief introduction for the visualisation.\r\nUsing interactive charts to allow users to select trade year and then focus on the top ten trade partners’ performance\r\nUsing Animation function to provide users the insight of the trend of trade value from 2011 to 2020.\r\nUsing color to differentiate the net importer and net exporter instead of using the center point measured by the diagonal line in the graph.\r\n4. Data Visualisation Steps\r\n4.1 Data preparation\r\nRemove unnecessary rows\r\nFor both Import data and Export data, delete the top five rows to let the row for ‘Variables’ and ‘the monthly period’ to be the first row, then delete the row for ‘Total Merchandise Trade’ and rename the data sheet ‘Import’ and ‘Export’ respectively using Excel. \r\nImport data into Tableau\r\nAfter importing data file into Tableau, double click ‘New Union’ on the left side of the page,then drag import file and export file into the ‘Union’ Popup, click Apply and Ok.\r\n\r\nSplit column\r\nClick the triangle sign on the left top of the ‘Variables’ column, then click split, the column would be split into two more columns. one is ‘Variables - Split 1’ and the other is ‘Variables - Split 2’.\r\n\r\nthe columns are as shown below after splitting.\r\n\r\nChange data type\r\nChange the data type for Variables column by clicking the data type icon on the right top of this column, and select ‘Geograhic Role’ - ‘Country/Region’. \r\nChange column name\r\nChange the name of ‘Variables - Split 1’ to ‘Markets’ by clicking the name of this column.\r\n\r\nHide columns\r\nHide all the columns except the ‘Markets’ ,‘Sheet’ and the column from ‘Jan 2011’ to ‘Dec 2020’ by selecting the columns and right click, then clicking hide to hide columns.\r\n\r\nCreate data pivot\r\nSelect columns from ‘Jan 2011’ to ‘Dec 2020’ at one time and right click, then click pivot.\r\n\r\nThe pivot is as shown.\r\n\r\nChange column name for pivot table\r\nChange ‘Pivot Names’ and ‘Pivot Values’ column to ‘Period’ and ‘Values’ respectively by double click the column name.\r\n\r\nChange data type for pivot table\r\nChange the data type for the ‘Period’ column to ‘date’ by clicking the data type icon on th right top of the column and select ‘date’.\r\nChang the data type for the ‘Values’ column to ‘Numbers’ by clicking the data type icon on th right top of the column and select ‘Numbers(decimal)’.\r\n\r\n4.2 Data visualisation\r\n1. Visualisation for Bubble Chart\r\n1.1. Create Calculated Fields\r\nClick ‘Analysis’ and select ‘Create Calculated Field’, then input ‘Export’ as the name of this field and input the formula in the box below. Repeat the same step to create the field [Import] using ‘Import’ to replace ‘Export’ in the formula. and to create the field [Total],[Ranking_Total] and [Export_vs_Import] using the formula as shown below.\r\n\r\n\r\n\r\n1.2 Drag data into canvas\r\nDrag [Export] and [Import] to Columns and Rows respectively.\r\n\r\n1.3 Apply Detail\r\nDrag [Markets] to detail to show detailed markets.\r\n\r\n1.4 Add Reference Line\r\n1.4.1 Drag [Import] to columns and right click [Import] to select dual-axis.\r\n\r\n1.4.2 Right click the top X-axis and select ‘Synchronize Axis’ and uncheck ‘Show Header’.\r\n\r\n1.4.3 Select ‘SUM(Import)’ pane and minimize the size.\r\n\r\n1.4.4 Select ‘SUM(Import)’ pane and adjust the opacity to zero.\r\n\r\n1.4.5 Remove ‘Measure values’ from the Mark pane.\r\n\r\n1.4.6 Right click the chart and select ‘Trend Lines’-‘Show Trend Lines’-‘SUM(Import)’.\r\n\r\n1.4.7 Change the format of the trend line to dot line by right click the trend line and select format, then change the ‘Trend lines’ to dot line.\r\n\r\n1.5 Apply color\r\nDrag [Export_vs_Import] to color,then click color and edit color. Select ‘orange’ for ‘Net Importer’ and select ‘blue’ for ‘Net Exporter’. Then change the marker type to circle.\r\n\r\n1.6 Differentiate size\r\nDrag [Total] to size to adjust the size by dragging the size cursor.\r\n\r\n1.7 Apply Filter\r\nDrag [Markets] to Filter pane and select by top 10 total values and drag [Period] to Filter and select year from 2011 to 2020.\r\n\r\n1.8 Add Tooltip\r\nDrag [Ranking_Total] to Tooltip and change the computing use to ‘Markets’ by rignt click AGG(Ranking_Total).\r\n\r\n1.9 Rename axis\r\nRename y-axis to “Import Trade Value”. Rename x-axis to “Export Trade Value”.\r\n1.10 Add title\r\nAdd title “Merchandise Import Trade in Six Markets, 2019-2020” using boldface. Then the visualisation is as shown below.\r\n\r\n2. Visualisation for Motion Chart\r\n2.1 Drag data into canvas\r\nDrag [Period] to Columns and chnage to ‘Month Year’ type, then drag [Export] and [Import] to Rows.\r\n\r\n2.2 Merge Axis\r\nRight click ‘SUM(Import)’ and check ‘Dual Axis’ but uncheck ‘Show Header’.\r\n\r\n1.3 Apply filter\r\nDrag [Period] to ‘Pages’ and change the format to ‘Month Year’.\r\n\r\n1.4 Apply Animations\r\n1.4.1 Click ‘Format’ and select ‘Animations’, then turn on the function and change ‘Duration’ to ‘Medium’ mode.\r\n\r\n1.4.2 Change mark to circle in ‘ALL pane’.\r\n\r\n1.4.3 Check ‘Show history’ box and click the triangle sign to setup as shown.\r\n\r\n1.5 Rename axis\r\nRename y-axis to “Trade Value”. Rename x-axis to “Trade Period”. Then the visualisation is as shown below.\r\n\r\n5. Final Visualization\r\n5.1 Snapshot of dashboard\r\n\r\nFull visualisation available at Tableau Public\r\n5.2 Major Insights\r\nThe import value and export value for each Singapore’s merchandise top ten trade partner are more and more closer. They distribute far away from the trade-off line in 2011, that means the import value and export value for each trade partner is discerte, but they are converging to the trade-off line and almost 80% of them are around the trade-off line in 2020.\r\n\r\n\r\nAlthough the export value is always more than the import value for Singapore’s merchandise trade with Mainland China from 2011 to 2020,the import value keeps increasing in the past ten years, they are quite closer since 2018.\r\n\r\nHong Kong is always a net exporter from 2011 to 2020, its value of both import and export keep stable and the export value is quite higher than import value. On the contrary, Taiwan is always a net importer in the past ten year, but its import and export value are sightly increasing from 2011 to 2020.\r\n\r\nMalaysia is a net exporter in 2011 that means the value of import is less than the value of export at that time, while its import value exceeds its export value since 2019 and becomes a net importer.In comparison,the value of export exceeds import for Singapore’s merchandise trade with United State in 2020,then United State is no longer a net importer as before but a net exporter in 2020.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T20:09:19+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Explore perspectives of Singapore Merchandise Trade in six markets from 2019 to 2020.",
    "author": [
      {
        "name": "Youzhen Zhang",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Overview\r\n2. Critiques and Recommendations\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Design\r\n4. Data Visualisation Steps\r\n4.1 Data preparation\r\n4.2 Data visualisation\r\n\r\n5. Final Visualization\r\n5.1 Snapshot of dashboard\r\n5.2 Major Insights\r\n\r\n\r\n1. Overview\r\nThe original visualisation below is created by using Merchandise Trade by Region/Market data provided by Department of Statistics, Singapore (DOS). In this post, this visualisation will be evaluated in terms of clarity and aesthetics. Also, an makeover of this graph will be provided. \r\n2. Critiques and Recommendations\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nChart title is not precise – The title “Merchandise Trade of Top Six Trading Countries,2019-2020” does not convey the intent of the graph well. The chart refers to the merchandise trade of top six regions from 2019 to 2020, making it difficult to identify the ranking of the six markets quickly.\r\nChange title to “Merchandise Trade of Six Trading Regions from 2019 to 2020”.\r\n2\r\nThe scale of X axis is not correct – The scale of X axis is from 2019 to 2021 that is inconsistent with the title of the graph. Also, the scale of values on X axis is year that is against the title of X axis.\r\nModify the scale of X axis of the graph only from 2019 to 2020 as presented in the title of the graph and change the scale of values on X axis to be year of period.\r\n3\r\nInappropriate usage of graph – A area graph is not a suitable graphing method to show the values of both import and export merchandise trade of regions. There are overlaps between the area of export and import merchandise trade, making it difficult to identify the information from export and import merchandise trade.\r\nIt would be much clearer if using a line graph to show the merchandise trade.\r\n4\r\nLack of captions in the graph – Captions can provide brief explanations accompanying to the graph.\r\nAdd captions at the bottom of the graph.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nThe font size and location of each region label – Font size of the label should be smaller than the title of the graph’s. The location of the label should be at the center to indicate the related area graph clearly.\r\nChange the font size of the region label smaller than the font size of title and move the label to the center of each area graph.\r\n2\r\nSix area graphs are redundant – It is not necessary to use six area graphs in the visualisation since the six area graphs have same coordinate axis and layouts.\r\nOnly keep one graph to show values with same coordinate axis and layouts.\r\n3\r\nColors used to differentiate the import and export merchandise trade do not highlight the graph – Colors used should be with higher degree of contrast to easy highlight the graph.\r\nUse colors with higher degree of contrast to differentiate the graph.\r\n4\r\nMultiple unit measurements of Y axis used in the graph – different unit measurements of Y axis may make readers be confused.\r\nKeep the unit measurements of both Y axis and X axis uniform.\r\n3. Proposed Design\r\n\r\n4. Data Visualisation Steps\r\n4.1 Data preparation\r\nData: Merchandise Imports By Region/Market, Monthly\r\nRemove unnecessary columns\r\nDelete useless columns, only keep column Variables and columns from 2019 Jan to 2020 Dec using Excel. \r\nRemove useless rows\r\nRemove unnecessary rows using Excel. \r\nImport into Tableau & Create data pivot\r\nAfter importing data file into Tableau, the data from January 2019 to December 2020 are spread across multiple columns. Then, we can create a flat file to get a target view by selecting the columns from 2019 Jan to 2020 Dec, right click and selecting pivot. \r\nRename column headers\r\nRename ‘Variables’ to ‘Region_Import’. Rename ‘Pivot Field Names’ to ‘Period_Import’. Rename ‘Pivot Field Values’ to ‘Trade Values_Import’. \r\nChange data type\r\nChange ‘Region_Import’ data type to ‘Geographic Role - Country/Region’. Change ‘Period_Import’ data type to ‘Date’. Change ‘Trade Values_Import’ data type to ‘Number(Whole)’. \r\nData: Merchandise Exports By Region/Market, Monthly\r\nTidy data and format data\r\nRepeat steps 1 to 3 as done for data ‘Merchandise Exports By Region/Market, Monthly’ above.\r\nRename column headers\r\nRename ‘Variables’ to ‘Region_Export’. Rename ‘Pivot Field Names’ to ‘Period_Export’. Rename ‘Pivot Field Values’ to ‘Trade Values_Export’.\r\nChange data type\r\nChange ‘Region_Export’ data type to ‘Geographic Role - Country/Region’. Change ‘Period_Export’ data type to ‘Date’. Change ‘Trade Values_Export’ data type to ‘Number(Whole)’.\r\n4.2 Data visualisation\r\nVisualisation for Merchandise import trade\r\nCreate line chart\r\nDrag [Period_import] and [Trade_Values_Import] to Columns and Rows respectively. Click [Period_import] and select ‘Quarter Year’ type. \r\nApply filter\r\nDrag [Region_Import] to Filters panel, and check these 6 values: Mainland China, Hong Kong, Taiwan, Malaysia, Japan and United States. \r\nApply colour\r\nDrag [Region_Import] to colour,then click colour and select line with dot marker. The graph will be colored automatically.\r\n\r\nRename axis\r\nRename y-axis to “Merchandise Trade Value”. Rename x-axis to “Quarter of Period”.\r\nAdd title\r\nAdd title “Merchandise Import Trade in Six Markets, 2019-2020” using boldface.\r\nAdd Caption\r\nRight click the graph and select “caption” to edit caption. Then the graph should shown as below.\r\n\r\nVisualisation for Merchandise export trade\r\nRepeat steps 1 to 6 as done for data ‘Visualisation for Merchandise import trade’ above except using data from export table instead of data from import table. \r\nVisualisation for Total Merchandise trade\r\nCreate calculated field\r\nClick ‘Create calculated field’ and input formula “IF Year([Period_Import])=2019 THEN [Trade_Values_Import]+[Trade_Values_Export] END” to create a new field named [2019].\r\nClick ‘Create calculated field’ and input formula “IF Year([Period_Import])=2020 THEN [Trade_Values_Import]+[Trade_Values_Export] END” to create a new field named [2020].\r\n\r\nCreate bar chart\r\nDrag [2019],[2020] and [Region_Import] to Columns and Rows respectively. Click X aixs of the 2019 to edit and select ‘reversed’ type for the axis.\r\n\r\nApply filter\r\nDrag [Region_Import] to Filters panel, and check these 6 values: Mainland China, Hong Kong, Taiwan, Malaysia, Japan and United States. \r\nApply colour\r\nClick ‘Color’ to edit colour n the Marks pane for 2019 ar chart,then the graph will be colored automatically.\r\n\r\nAdd title\r\nAdd title “Total Merchandise Trade of Six Markets, 2019-2020” using boldface. Then, the graph should shown as below. \r\nFull visualisation available at Tableau Public\r\n5. Final Visualization\r\n5.1 Snapshot of dashboard\r\n\r\n5.2 Major Insights\r\nMainland China is the biggest merchandise trade market for Singapore among the six markets from 2019 to 2020, although the total merchandise trade volumn has a sight decline in 2020.\r\nThe total merchandise trade volumns in Taiwan and Hong Kong markets keep increasing from 2019 to 2020, while the merchandise trade values for other four markets in 2020 are less than that in 2019.\r\nMerchandise trade in quarter four is always higher than that in other three quarters for Both Merchandise import trade and export trade.\r\nBoth merchandise exports and imports in Japan market show a almost stable trend from 2019 to 2020.\r\nAlthough merchandise import trade in Hong Kong is always lower than other markets, the merchandise export trade shows a increase trend from 2019 to 2020. The merchandise export trade volumn in Hong Kong markets is higher than other four markets except Mainland China market.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-13T17:36:15+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
