[
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Explore different perspectives in Merchandise Trade by Region/Market Report.",
    "author": [
      {
        "name": "Youzhen Zhang",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1. Overview\r\nThe original visualisation below is created by using Merchandise Trade by Region/Market data provided by Department of Statistics, Singapore (DOS). In this post, this visualisation will be evaluated in terms of clarity and aesthetics. Also, an makeover of this graph will be provided. \r\n2. Critiques and Recommendations\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nChart title is not precise – The title “Merchandise Trade of Top Six Trading Countries,2019-2020” does not convey the intent of the graph well. The chart refers to the merchandise trade of top six regions from 2019 to 2020, making it difficult to identify the ranking of the six markets quickly.\r\nChange title to “Merchandise Trade of Six Trading Regions from 2019 to 2020”.\r\n2\r\nThe scale of X axis is not correct – The scale of X axis should be from 2019 to 2021 that is inconsistent with the title of the graph. Also, the scale of values on X axis is year that is against the title of X axis.\r\nModify the scale of X axis of the graph only from 2019 to 2020 as presented in the title of the graph and change the scale of values on X axis to be month.\r\n3\r\nInappropriate usage of graph – A area graph is not a suitable graphing method to show the values of both import and export merchandise trade of regions. There are overlaps between the area of export and import merchandise trade, making it difficult to identify the information from export and import merchandise trade.\r\nIt would be much clearer if using a line graph to show the merchandise trade.\r\n4\r\nLack of captions in the graph – Captions can provide brief explanations accompanying to the graph.\r\nAdd captions at the bottom of the graph.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nThe font size and location of each region label – Font size of the label should be smaller than the title of the graph’s. The location of the label should be at the center to indicate the related area graph clearly.\r\nChange the font size of the region label smaller than the font size of title and move the label to the center of each area graph.\r\n2\r\nSix area graphs are redundant – It is not necessary to use six area graphs in the visualisation since the six area graphs have same coordinate axis and layouts.\r\nOnly keep one graph to show values with same coordinate axis and layouts.\r\n3\r\nColors used to differentiate the import and export merchandise trade do not highlight the graph – Colors used should be with higher degree of contrast to easy highlight the graph.\r\nUse colors with higher degree of contrast to differentiate the graph.\r\n4\r\nMultiple unit measurements of Y axis used in the graph – different unit measurements of Y axis may make readers be confused.\r\nKeep the unit measurements of both Y axis and X axis uniform.\r\n3. Proposed Design\r\n4. Data Visualisation Steps\r\n4.1 Data preparation\r\nData: Merchandise Imports By Region/Market, Monthly\r\nRemove unnecessary columns Delete useless columns, only keep column Variables and columns from 2019 Jan to 2020 Dec using Excel. \r\nRemove useless rows Remove unnecessary rows using Excel. \r\nImport into Tableau & Create data pivot After importing data file into Tableau, the data from January 2019 to December 2020 are spread across multiple columns. Then, we can create a flat file to get a target view by selecting the columns from 2019 Jan to 2020 Dec, right click and selecting pivot. \r\nRename column headers Rename ‘Variables’ to ‘Region’. Rename ‘Pivot Field Names’ to ‘Month of Period’. Rename ‘Pivot Field Values’ to ‘rade Values’. \r\nChange data type Change ‘Region’ data type to ‘Geographic Role - Country/Region’. Change ‘Month of Period’ data type to ‘Date’. Change ‘Trade Values’ data type to ‘Number(Whole)’. \r\nMerchandise Exports By Region/Market, Monthly\r\nTidy data and format data Repeat steps 1 to 5 as done for data ‘Merchandise Exports By Region/Market, Monthly’ above.\r\n4.1 Data visualisation\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-24T19:39:45+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
